mesh/org/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       3880;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       3900;
    }
    wall_btm
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       3920;
    }
    wall_top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       4020;
    }
    empty_A
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2000;
        startFace       4120;
    }
    empty_B
    {
        type            empty;
        inGroups        1(empty);
        nFaces          2000;
        startFace       6120;
    }
)

// ************************************************************************* //
