mesh/org/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
    (0  -0.5 0)
    (5  -0.5 0)
    (0   0.5 0)
    (5   0.5 0)
    (0  -0.5 0.1)
    (5  -0.5 0.1)
    (0   0.5 0.1)
    (5   0.5 0.1)
);

blocks
(
    hex (0 1 3 2 4 5 7 6) (50 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 2 4 6)
        );
    }
    outlet
    {
        type wall;
        faces
        (
            (1 3 5 7)
        );
    }
    wall_btm
    {
        type wall;
        faces
        (
            (0 1 4 5)
        );
    }
    wall_top
    {
        type wall;
        faces
        (
            (2 3 6 7)
        );
    }
    empty_A
    {
        type empty;
        faces
        (
            (0 1 2 3)
        );
    }
    empty_B
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
